Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/src/hc32f4a0_usb_core.c
    if(USB_OTG_OK == status)
    {
        /* Core Soft Reset */
        count = 0UL;
        greset.b.csftrst = 1U;
        USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GRSTCTL, *(__IO uint32_t*)&greset.b ); /* C-STAT */
        do
        {
            greset.b = *(__IO stc_bUSB_OTG_GRSTCTL_t*)&USB_OTG_READ_REG32(&pdev->regs.GREGS->GRSTCTL); /* C-STAT */
            if (++count > 100000UL)
            {
              break;
            }
            USB_OTG_BSP_uDelay(1UL);
        }
        while (greset.b.csftrst == 1U);
        /* Wait for 3 PHY Clocks*/
        USB_OTG_BSP_uDelay(3UL);
    }
    return status;
}

/**
 * @}
 */

/**
 * @defgroup USB_Core_Global_Functions USB Core Global Functions
 * @{
 */

/**
 * @brief  USB_OTG_WritePacket Writes a packet into the Tx FIFO associated
 *         with the EP
 * @param  [in] pdev         Instance for USB core
 * @param  [in] src          Source pointer
 * @param  [in] ch_ep_num    End point number
 * @param  [in] len          No. of bytes
 * @retval USB_OTG_STS  Status
 */
USB_OTG_STS USB_OTG_WritePacket(USB_OTG_CORE_HANDLE *pdev,
                                uint8_t             *src,
                                uint8_t             ch_ep_num,
                                uint16_t            len)
{
    uint32_t u32pAdr;
    uint32_t count32b;
    uint32_t i;
    __IO uint32_t *fifo;

    if (pdev->cfg.dma_enable == 0U)
    {
        count32b =  (len + 3UL) / 4UL;
        fifo = pdev->regs.DFIFO[ch_ep_num];
        for (i = 0UL; i < count32b; i++)
        {
            //USB_OTG_WRITE_REG32( fifo, *((__packed uint32_t *)src) );
            USB_OTG_WRITE_REG32( fifo, *((uint32_t *)src) );
            //src+=4UL;   /* C-STAT */
            u32pAdr = (uint32_t)src;
            src = (uint8_t*)(u32pAdr+4UL);
        }
    }
    return USB_OTG_OK;
}


/**
 * @brief  USB_OTG_ReadPacket  Reads a packet from the Rx FIFO
 * @param  [in] pdev     Instance for USB core
 * @param  [in] dest     Destination Pointer
 * @param  [in] len      No. of bytes
 * @retval None
 */
void *USB_OTG_ReadPacket(USB_OTG_CORE_HANDLE *pdev,
                         uint8_t *dest,
                         uint16_t len)
{
    uint32_t i;
    const uint32_t count32b = (len + 3UL) / 4UL;
    uint32_t u32pAdr;

    __IO uint32_t *fifo = pdev->regs.DFIFO[0UL];

    for ( i = 0UL; i < count32b; i++)
    {
        //*(__packed uint32_t *)dest = USB_OTG_READ_REG32(fifo);
        *(uint32_t *)dest = USB_OTG_READ_REG32(fifo);
        //dest += 4UL;   /* MISRAC 2004*/
        u32pAdr = (uint32_t)dest;
        dest = (uint8_t*)(u32pAdr + 4UL);
    }
    return ((void *)dest);
}


/**
 * @brief  USB_OTG_GetDeviceSpeed
 *         Get the device speed from the device status register
 * @param  [in] pdev             Instance for USB core
 * @retval status
 */
enum USB_OTG_SPEED USB_OTG_GetDeviceSpeed (USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_DSTS_TypeDef  dsts;
    enum USB_OTG_SPEED speed = USB_SPEED_UNKNOWN;

    dsts.b = *(__IO stc_bUSB_OTG_DSTS_t*)&USB_OTG_READ_REG32(&pdev->regs.DREGS->DSTS); /* C-STAT */

    switch (dsts.b.enumspd)
    {
        case DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ:
            speed = USB_SPEED_HIGH;
            break;
        case DSTS_ENUMSPD_FS_PHY_30MHZ_OR_60MHZ:
        case DSTS_ENUMSPD_FS_PHY_48MHZ:
            speed = USB_SPEED_FULL;
            break;
        case DSTS_ENUMSPD_LS_PHY_6MHZ:
            speed = USB_SPEED_LOW;
            break;
        default:
            break;
    }

    return speed;
}

/**
 * @brief  USB_OTG_GetMode : Get current mode
 * @param  [in] pdev     Instance for USB core
 * @retval current mode
 */
uint32_t USB_OTG_GetMode(USB_OTG_CORE_HANDLE *pdev)
{
    return (USB_OTG_READ_REG32(&pdev->regs.GREGS->GINTSTS ) & 0x1UL);
}

/**
 * @brief  USB_OTG_IsDeviceMode : Check if it is device mode
 * @param  [in] pdev     Instance for USB core
 * @retval num_in_ep
 */
uint8_t USB_OTG_IsDeviceMode(USB_OTG_CORE_HANDLE *pdev)
{
    return (uint8_t)(USB_OTG_GetMode(pdev) != (uint32_t)HOST_MODE);
}


/**
 * @brief  USB_OTG_ReadCoreItr : returns the Core Interrupt register
 * @param  [in] pdev     Instance for USB core
 * @retval Status
 */
uint32_t USB_OTG_ReadCoreItr(USB_OTG_CORE_HANDLE *pdev)
{
    uint32_t v;
    v = USB_OTG_READ_REG32(&pdev->regs.GREGS->GINTSTS);
    v &= USB_OTG_READ_REG32(&pdev->regs.GREGS->GINTMSK);
    return v;
}

/**
 * @brief  USB_OTG_SelectCore
 *         Initialize core registers address.
 * @param  [in] pdev         Instance for USB core
 * @param  [in] coreID       USB OTG Core ID
 * @retval USB_OTG_STS  status
 */
USB_OTG_STS USB_OTG_SelectCore(USB_OTG_CORE_HANDLE *pdev,
                               USB_OTG_CORE_ID_TypeDef coreID)
{
    uint32_t i;
    uint32_t baseAddress;
    USB_OTG_STS status = USB_OTG_OK;
    pdev->cfg.dma_enable       = 0U;

    /* at startup the core is in FS mode */
    pdev->cfg.speed            = USB_OTG_SPEED_FULL;
    pdev->cfg.mps              = USB_OTG_FS_MAX_PACKET_SIZE ;

    /* initialize device cfg following its address */
    if (coreID == USB_OTG_FS_CORE_ID)
    {
        baseAddress                = USB_OTG_FS_BASE_ADDR;
        pdev->cfg.coreID           = (uint8_t)USB_OTG_FS_CORE_ID;
        pdev->cfg.host_channels    = 16U;
        pdev->cfg.dev_endpoints    = 16U;
        pdev->cfg.TotalFifoSize    = 640U; /* in 32-bits */
        pdev->cfg.phy_itface       = USB_OTG_EMBEDDED_PHY;

#ifdef USB_OTG_FS_SOF_OUTPUT_ENABLED
        pdev->cfg.Sof_output       = 1U;
#endif
#ifdef USB_OTG_HS_INTERNAL_DMA_ENABLED
        pdev->cfg.dma_enable       = 1U;
#endif

#ifdef USB_OTG_FS_LOW_PWR_MGMT_SUPPORT
        pdev->cfg.low_power        = 1U;
#endif
    }
    //else if (coreID == USB_OTG_HS_CORE_ID)
    else
    {
        baseAddress                = USB_OTG_HS_BASE_ADDR;
        pdev->cfg.coreID           = (uint8_t)USB_OTG_HS_CORE_ID;
        pdev->cfg.host_channels    = 16U;
        pdev->cfg.dev_endpoints    = 16U;
        pdev->cfg.TotalFifoSize    = 2048U;/* in 32-bits */

#ifdef USB_OTG_ULPI_PHY_ENABLED
        pdev->cfg.phy_itface       = USB_OTG_ULPI_PHY;
#else
#ifdef USB_OTG_EMBEDDED_PHY_ENABLED
        pdev->cfg.phy_itface       = USB_OTG_EMBEDDED_PHY;
#endif
#endif

#ifdef USB_OTG_HS_INTERNAL_DMA_ENABLED
        pdev->cfg.dma_enable       = 1U;
#endif

#ifdef USB_OTG_HS_SOF_OUTPUT_ENABLED
        pdev->cfg.Sof_output       = 1U;
#endif

#ifdef USB_OTG_HS_LOW_PWR_MGMT_SUPPORT
        pdev->cfg.low_power        = 1U;
#endif
  }

    pdev->regs.GREGS = (USB_OTG_GREGS *)(baseAddress + \
        USB_OTG_CORE_GLOBAL_REGS_OFFSET);
    pdev->regs.DREGS =  (USB_OTG_DREGS  *)  (baseAddress + \
        USB_OTG_DEV_GLOBAL_REG_OFFSET);

    for (i = 0UL; i < pdev->cfg.dev_endpoints; i++)
    {
        pdev->regs.INEP_REGS[i]  = (USB_OTG_INEPREGS *)  \
            (baseAddress + USB_OTG_DEV_IN_EP_REG_OFFSET + \
            (i * USB_OTG_EP_REG_OFFSET));
        pdev->regs.OUTEP_REGS[i] = (USB_OTG_OUTEPREGS *) \
            (baseAddress + USB_OTG_DEV_OUT_EP_REG_OFFSET + \
            (i * USB_OTG_EP_REG_OFFSET));
    }
    pdev->regs.HREGS = (USB_OTG_HREGS *)(baseAddress + USB_OTG_HOST_GLOBAL_REG_OFFSET);
    pdev->regs.HPRT0 = (uint32_t *)(baseAddress + USB_OTG_HOST_PORT_REGS_OFFSET);

    for (i = 0UL; i < pdev->cfg.host_channels; i++)
    {
        pdev->regs.HC_REGS[i] = (USB_OTG_HC_REGS *)(baseAddress + \
            USB_OTG_HOST_CHAN_REGS_OFFSET + (i * USB_OTG_CHAN_REGS_OFFSET));
    }
    for (i = 0UL; i < pdev->cfg.host_channels; i++)
    {
        pdev->regs.DFIFO[i] = (uint32_t *)(baseAddress + USB_OTG_DATA_FIFO_OFFSET +\
            (i * USB_OTG_DATA_FIFO_SIZE));
    }
    pdev->regs.PCGCCTL = (uint32_t *)(baseAddress + USB_OTG_PCGCCTL_OFFSET);

