Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/src/hc32f4a0_usb_core.c
    return status;
}
/* *********************        PCD Core Layer       **************************/

/**
 * @brief  USB_OTG_InitDevSpeed :Initializes the DevSpd field of DCFG register
 *         depending the PHY type and the enumeration speed of the device.
 * @param  [in] pdev     Instance for USB core
 * @param  [in] speed    Speed for USB
 * @retval None
 */
void USB_OTG_InitDevSpeed(USB_OTG_CORE_HANDLE *pdev , uint8_t speed)
{
    USB_OTG_DCFG_TypeDef   dcfg;

    dcfg.d32 = USB_OTG_READ_REG32(&pdev->regs.DREGS->DCFG);
    dcfg.b.devspd = speed;
    USB_OTG_WRITE_REG32(&pdev->regs.DREGS->DCFG, dcfg.d32);
}

/**
 * @brief  USB_OTG_CoreInit
 *         Initializes the USB_OTG controller registers and prepares the core
 *         device mode or host mode operation.
 * @param  [in] pdev     Instance for USB core
 * @retval USB_OTG_STS status
 */
USB_OTG_STS USB_OTG_CoreInit(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_STS status = USB_OTG_OK;
    USB_OTG_GUSBCFG_TypeDef  usbcfg;
    USB_OTG_GAHBCFG_TypeDef  ahbcfg;

    usbcfg.d32 = 0UL;
    ahbcfg.d32 = 0UL;

    USB_OTG_CoreReset(pdev);

    if (pdev->cfg.phy_itface == USB_OTG_ULPI_PHY)
    {
        /* Init The ULPI Interface */
        usbcfg.d32 = 0UL;
        usbcfg.d32 = USB_OTG_READ_REG32(&pdev->regs.GREGS->GUSBCFG);

        usbcfg.b.physel            = 0U; /* HS Interface */
#ifdef USB_OTG_INTERNAL_VBUS_ENABLED
        usbcfg.b.ulpi_ext_vbus_drv = 0U; /* Use internal VBUS */
#else
#ifdef USB_OTG_EXTERNAL_VBUS_ENABLED
        usbcfg.b.ulpi_ext_vbus_drv = 1U; /* Use external VBUS */
#endif
#endif
        usbcfg.b.ulpi_utmi_sel = 1U;
        USB_OTG_WRITE_REG32 (&pdev->regs.GREGS->GUSBCFG, usbcfg.d32);

        /* Reset after a PHY select  */
        USB_OTG_CoreReset(pdev);

        if(pdev->cfg.dma_enable == 1U)
        {

          ahbcfg.b.hburstlen = 5U; /* 64 x 32-bits*/
          ahbcfg.b.dmaenable = 1U;
          USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GAHBCFG, ahbcfg.d32);

        }
    }
    else /* FS interface (embedded Phy) */
    {
        usbcfg.d32 = USB_OTG_READ_REG32(&pdev->regs.GREGS->GUSBCFG);
        usbcfg.b.physel  = 1U; /* FS Interface */
        USB_OTG_WRITE_REG32 (&pdev->regs.GREGS->GUSBCFG, usbcfg.d32);
        /* Reset after a PHY select and set Host mode */
        USB_OTG_CoreReset(pdev);

        USB_OTG_BSP_mDelay(20UL);
    }

    /* case the HS core is working in FS mode */
    if(pdev->cfg.dma_enable == 1U)
    {
        ahbcfg.d32 = USB_OTG_READ_REG32(&pdev->regs.GREGS->GAHBCFG);
        ahbcfg.b.hburstlen = 5U; /* 64 x 32-bits*/
        ahbcfg.b.dmaenable = 1U;
        USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GAHBCFG, ahbcfg.d32);
    }
    /* initialize OTG features */
#ifdef  USE_OTG_MODE
    usbcfg.d32 = USB_OTG_READ_REG32(&pdev->regs.GREGS->GUSBCFG);
    usbcfg.b.hnpcap = 1U;
    usbcfg.b.srpcap = 1U;
    USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GUSBCFG, usbcfg.d32);
    USB_OTG_EnableCommonInt(pdev);
#endif
    return status;
}

/**
 * @brief  USB_OTG_EnableGlobalInt
 *         Enables the controller's Global Int in the AHB Config reg
 * @param  [in] pdev     Instance for USB core
 * @retval USB_OTG_STS status
 */
USB_OTG_STS USB_OTG_EnableGlobalInt(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_STS status = USB_OTG_OK;
    USB_OTG_GAHBCFG_TypeDef  ahbcfg;

    ahbcfg.d32 = 0UL;
    ahbcfg.b.glblintrmsk = 1U;
    USB_OTG_MODIFY_REG32(&pdev->regs.GREGS->GAHBCFG, 0UL, ahbcfg.d32);
    return status;
}


/**
 * @brief  USB_OTG_DisableGlobalInt
 *         Enables the controller's Global Int in the AHB Config reg
 * @param  [in] pdev     Instance for USB core
 * @retval USB_OTG_STS status
 */
USB_OTG_STS USB_OTG_DisableGlobalInt(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_STS status = USB_OTG_OK;
    USB_OTG_GAHBCFG_TypeDef  ahbcfg;
    ahbcfg.d32 = 0UL;
    ahbcfg.b.glblintrmsk = 1U;
    USB_OTG_MODIFY_REG32(&pdev->regs.GREGS->GAHBCFG, ahbcfg.d32, 0UL);
    return status;
}

USB_OTG_STS USB_OTG_stop_xfer (USB_OTG_CORE_HANDLE *pdev , uint32_t num )
{
    USB_OTG_STS status = USB_OTG_OK;
    USB_OTG_DEPCTL_TypeDef  depctl;
    USB_OTG_DIEPINTn_TypeDef diepint;

    if (USB_OTG_READ_REG32(&pdev->regs.INEP_REGS[num]->DIEPTSIZ) == 0UL)
    {
        status = USB_OTG_OK;
    }
    else
    {
        depctl.d32 = 0UL;

        depctl.b.epdis = 1U;
        depctl.b.snak = 1U;
        USB_OTG_WRITE_REG32( &pdev->regs.INEP_REGS[num]->DIEPCTL, depctl.d32 );

        do
        {
            diepint.b = *(__IO stc_bUSB_OTG_DIEPINTn_t*)&USB_OTG_READ_REG32(&pdev->regs.INEP_REGS[num]->DIEPINT); /* C-STAT */
        } while (0UL == diepint.b.epdisabled);
        *(uint32_t*)&diepint.b = 0UL;   /* C-STAT */
        diepint.b.epdisabled = 1U;
        USB_OTG_WRITE_REG32( &pdev->regs.INEP_REGS[num]->DIEPINT, *(uint32_t*)&diepint.b ); /* C-STAT */

        depctl.b.epdis = 0U;
        depctl.b.epena = 0U;
        USB_OTG_WRITE_REG32( &pdev->regs.INEP_REGS[num]->DIEPCTL, depctl.d32 );
    }
    return status;
}

/**
 * @brief  USB_OTG_FlushTxFifo : Flush a Tx FIFO
 * @param  [in] pdev     Instance for USB core
 * @param  [in] num      FO num
 * @retval USB_OTG_STS status
 */
USB_OTG_STS USB_OTG_FlushTxFifo (USB_OTG_CORE_HANDLE *pdev , uint32_t num )
{
    USB_OTG_STS status = USB_OTG_OK;
    __IO USB_OTG_GRSTCTL_TypeDef  greset;

    uint32_t count = 0UL;
    greset.d32 = 0UL;
    greset.b.txfflsh = 1U;
    greset.b.txfnum  = num;
    USB_OTG_WRITE_REG32( &pdev->regs.GREGS->GRSTCTL, greset.d32 );
    do
    {
        greset.b = *(__IO stc_bUSB_OTG_GRSTCTL_t*)&(USB_OTG_READ_REG32( &pdev->regs.GREGS->GRSTCTL)); /* C-STAT */
        if (++count > 200000UL)
        {
            ;//break;
        }
        USB_OTG_BSP_uDelay(1UL);
    }
    while (greset.b.txfflsh == 1U);
    /* Wait for 3 PHY Clocks*/
    USB_OTG_BSP_uDelay(3UL);
    return status;
}

/**
 * @brief  USB_OTG_FlushRxFifo : Flush a Rx FIFO
 * @param  [in] pdev     Instance for USB core
 * @retval USB_OTG_STS status
 */
USB_OTG_STS USB_OTG_FlushRxFifo( USB_OTG_CORE_HANDLE *pdev )
{
    USB_OTG_STS status = USB_OTG_OK;
    __IO USB_OTG_GRSTCTL_TypeDef  greset;
    uint32_t count = 0UL;

    greset.d32 = 0UL;
    greset.b.rxfflsh = 1U;
    USB_OTG_WRITE_REG32( &pdev->regs.GREGS->GRSTCTL, greset.d32 );
    do
    {
        greset.b = *(__IO stc_bUSB_OTG_GRSTCTL_t*)&USB_OTG_READ_REG32( &pdev->regs.GREGS->GRSTCTL); /* C-STAT */
        if (++count > 200000UL)
        {
            ;//break;
        }
        USB_OTG_BSP_uDelay(1UL);
    }
    while (greset.b.rxfflsh == 1U);
    /* Wait for 3 PHY Clocks*/
    USB_OTG_BSP_uDelay(3UL);
    return status;
}


/**
 * @brief  USB_OTG_SetCurrentMode : Set ID line
 * @param  [in] pdev     Instance for USB core
 * @param  [in] mode     (Host/device)
 * @retval USB_OTG_STS status
 */
USB_OTG_STS USB_OTG_SetCurrentMode(USB_OTG_CORE_HANDLE *pdev , uint8_t mode)
{
    USB_OTG_STS status = USB_OTG_OK;
    USB_OTG_GUSBCFG_TypeDef  usbcfg;

    usbcfg.d32 = USB_OTG_READ_REG32(&pdev->regs.GREGS->GUSBCFG);

    usbcfg.b.force_host_mode = 0U;
    usbcfg.b.force_dev_mode = 0U;

    if ( mode == HOST_MODE)
    {
        usbcfg.b.force_host_mode = 1U;
    }
    else
    {
        usbcfg.b.force_dev_mode = 1U;
    }

    USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GUSBCFG, usbcfg.d32);
    USB_OTG_BSP_mDelay(50UL);
    return status;
}

/**
 * @brief  USB_OTG_CoreInitDev : Initializes the USB_OTG controller registers
 *         for device mode
 * @param  [in] pdev     Instance for USB core
 * @retval USB_OTG_STS status
 */
USB_OTG_STS USB_OTG_CoreInitDev (USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_STS             status = USB_OTG_OK;
    USB_OTG_DEPCTL_TypeDef  depctl;
    uint32_t i;
    USB_OTG_DCFG_TypeDef    dcfg;
    USB_OTG_FSIZ_TypeDef    nptxfifosize;
//#ifdef USB_OTG_HS_CORE
    USB_OTG_FSIZ_TypeDef    txfifosize;
//#endif
//    USB_OTG_GRSTCTL_TypeDef greset = {.d32 = 0 };
    USB_OTG_DCTL_TypeDef        dctl;

    *(uint32_t*)&depctl.b = 0UL;  /* C-STAT */
    dcfg.d32 = 0UL;
    *(uint32_t*)&nptxfifosize.b = 0UL;  /* C-STAT */
//#ifdef USB_OTG_HS_CORE
    *(uint32_t*)&txfifosize.b = 0UL;  /* C-STAT */
//#endif
    /* Device configuration register */
    dcfg.d32 = USB_OTG_READ_REG32( &pdev->regs.DREGS->DCFG);
    dcfg.b.perfrint = DCFG_FRAME_INTERVAL_80;
    USB_OTG_WRITE_REG32( &pdev->regs.DREGS->DCFG, dcfg.d32 );

#ifdef USB_OTG_FS_CORE
    if(pdev->cfg.coreID == (uint8_t)USB_OTG_FS_CORE_ID)
    {
        /* Set Full speed phy */
        USB_OTG_InitDevSpeed (pdev , USB_OTG_SPEED_PARAM_FULL);

