Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/src/hc32f4a0_usb_core.c
        /* set Rx FIFO size */
        USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GRXFSIZ, (uint32_t)RX_FIFO_FS_SIZE);

        /* EP0 TX*/
        nptxfifosize.b.depth     = (uint32_t)TX0_FIFO_FS_SIZE;
        nptxfifosize.b.startaddr = (uint32_t)RX_FIFO_FS_SIZE;
        USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GNPTXFSIZ, *(uint32_t*)&nptxfifosize.b ); /* C-STAT */

        #if 1
        /* EP1 TX*/
        txfifosize.b.startaddr = nptxfifosize.b.startaddr + nptxfifosize.b.depth;
        txfifosize.b.depth = (uint32_t)TX1_FIFO_FS_SIZE;
        USB_OTG_WRITE_REG32(&pdev->regs.GREGS->DPTXFSIZ[0], *(uint32_t*)&txfifosize.b );  /* C-STAT */

        /* EP2 TX*/
        txfifosize.b.startaddr += txfifosize.b.depth;
        txfifosize.b.depth = (uint32_t)TX2_FIFO_FS_SIZE;
        USB_OTG_WRITE_REG32(&pdev->regs.GREGS->DPTXFSIZ[1], *(uint32_t*)&txfifosize.b ); /* C-STAT */

        /* EP3 TX*/
        txfifosize.b.startaddr += txfifosize.b.depth;
        txfifosize.b.depth = (uint32_t)TX3_FIFO_FS_SIZE;
        USB_OTG_WRITE_REG32( &pdev->regs.GREGS->DPTXFSIZ[2], *(uint32_t*)&txfifosize.b );  /* C-STAT */

        /* EP4 TX*/
        txfifosize.b.startaddr += txfifosize.b.depth;
        txfifosize.b.depth = (uint32_t)TX4_FIFO_FS_SIZE;
        USB_OTG_WRITE_REG32( &pdev->regs.GREGS->DPTXFSIZ[3], *(uint32_t*)&txfifosize.b );  /* C-STAT */

        /* EP5 TX*/
        txfifosize.b.startaddr += txfifosize.b.depth;
        txfifosize.b.depth = (uint32_t)TX5_FIFO_FS_SIZE;
        USB_OTG_WRITE_REG32( &pdev->regs.GREGS->DPTXFSIZ[4], *(uint32_t*)&txfifosize.b );  /* C-STAT */
        #endif
    }
#endif
#ifdef USB_OTG_HS_CORE
    if(pdev->cfg.coreID == USB_OTG_HS_CORE_ID  )
    {
        /* Set High speed phy */
        if(pdev->cfg.phy_itface  == USB_OTG_ULPI_PHY)
        {
          USB_OTG_InitDevSpeed (pdev , USB_OTG_SPEED_PARAM_HIGH);
        }
        else /* set High speed phy in Full speed mode */
        {
          USB_OTG_InitDevSpeed (pdev , USB_OTG_SPEED_PARAM_HIGH_IN_FULL);
        }

        /* set Rx FIFO size */
        USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GRXFSIZ, RX_FIFO_HS_SIZE);

        /* EP0 TX*/
        nptxfifosize.b.depth     = TX0_FIFO_HS_SIZE;
        nptxfifosize.b.startaddr = RX_FIFO_HS_SIZE;
        USB_OTG_WRITE_REG32( &pdev->regs.GREGS->GNPTXFSIZ, nptxfifosize.d32 );

        /* EP1 TX*/
        txfifosize.b.startaddr = nptxfifosize.b.startaddr + nptxfifosize.b.depth;
        txfifosize.b.depth = TX1_FIFO_HS_SIZE;
        USB_OTG_WRITE_REG32( &pdev->regs.GREGS->DPTXFSIZ[0U], txfifosize.d32 );

        USB_OTG_WRITE_REG32( &pdev->regs.GREGS->DPTXFSIZ[1U], 0U );
        USB_OTG_WRITE_REG32( &pdev->regs.GREGS->DPTXFSIZ[2U], 0U );
        USB_OTG_WRITE_REG32( &pdev->regs.GREGS->DPTXFSIZ[3U], 0U );
        USB_OTG_WRITE_REG32( &pdev->regs.GREGS->DPTXFSIZ[4U], 0U );
        USB_OTG_WRITE_REG32( &pdev->regs.GREGS->DPTXFSIZ[5U], 0U );
        USB_OTG_WRITE_REG32( &pdev->regs.GREGS->DPTXFSIZ[6U], 0U );

        #if 0
        /* EP2 TX*/
        txfifosize.b.startaddr += txfifosize.b.depth;
        txfifosize.b.depth = TX2_FIFO_HS_SIZE;
        USB_OTG_WRITE_REG32( &pdev->regs.GREGS->DIEPTXF[1], txfifosize.d32 );

        /* EP3 TX*/
        txfifosize.b.startaddr += txfifosize.b.depth;
        txfifosize.b.depth = TX3_FIFO_HS_SIZE;
        USB_OTG_WRITE_REG32( &pdev->regs.GREGS->DIEPTXF[2], txfifosize.d32 );

        /* EP4 TX*/
        txfifosize.b.startaddr += txfifosize.b.depth;
        txfifosize.b.depth = TX4_FIFO_HS_SIZE;
        USB_OTG_WRITE_REG32( &pdev->regs.GREGS->DIEPTXF[3], txfifosize.d32 );

        /* EP5 TX*/
        txfifosize.b.startaddr += txfifosize.b.depth;
        txfifosize.b.depth = TX5_FIFO_HS_SIZE;
        USB_OTG_WRITE_REG32( &pdev->regs.GREGS->DIEPTXF[4], txfifosize.d32 );
        #endif
    }
#endif
    /* Clear all pending Device Interrupts */
    USB_OTG_WRITE_REG32( &pdev->regs.DREGS->DIEPMSK, 0UL );
    USB_OTG_WRITE_REG32( &pdev->regs.DREGS->DOEPMSK, 0UL );
    USB_OTG_WRITE_REG32( &pdev->regs.DREGS->DAINT, 0xFFFFFFFFUL );
    USB_OTG_WRITE_REG32( &pdev->regs.DREGS->DAINTMSK, 0UL );

    for (i = 0UL; i < pdev->cfg.dev_endpoints; i++)
    {
        depctl.b = *(__IO stc_bUSB_OTG_DEPCTL_t*)&USB_OTG_READ_REG32(&pdev->regs.INEP_REGS[i]->DIEPCTL);  /* C-STAT */
        if (depctl.b.epena != 0UL)
        {
            *(uint32_t*)&depctl.b = 0UL;  /* C-STAT */
            depctl.b.epdis = 1U;
            depctl.b.snak = 1U;
        }
        else
        {
            *(uint32_t*)&depctl.b = 0UL;  /* C-STAT */
        }
        USB_OTG_WRITE_REG32( &pdev->regs.INEP_REGS[i]->DIEPCTL, *(uint32_t*)&depctl.b);   /* C-STAT */
        USB_OTG_WRITE_REG32( &pdev->regs.INEP_REGS[i]->DIEPTSIZ, 0UL);
        USB_OTG_WRITE_REG32( &pdev->regs.INEP_REGS[i]->DIEPINT, 0xFFUL);
    }
    for (i = 0UL; i <  pdev->cfg.dev_endpoints; i++)
    {
        depctl.b = *(__IO stc_bUSB_OTG_DEPCTL_t*)&USB_OTG_READ_REG32(&pdev->regs.OUTEP_REGS[i]->DOEPCTL); /* C-STAT */
        if (depctl.b.epena != 0UL)
        {
            *(uint32_t*)&depctl.b = 0UL;  /* C-STAT */
            depctl.b.epdis = 1U;
            depctl.b.snak = 1U;
        }
        else
        {
            *(uint32_t*)&depctl.b = 0UL;  /* C-STAT */
        }
        USB_OTG_WRITE_REG32( &pdev->regs.OUTEP_REGS[i]->DOEPCTL, *(uint32_t*)&depctl.b);  /* C-STAT */
        USB_OTG_WRITE_REG32( &pdev->regs.OUTEP_REGS[i]->DOEPTSIZ, 0UL);
        USB_OTG_WRITE_REG32( &pdev->regs.OUTEP_REGS[i]->DOEPINT, 0xFFUL);
    }
//  msk.d32 = 0U;
//  msk.b.txfifoundrn = 1U;
//  USB_OTG_MODIFY_REG32(&pdev->regs.DREGS->DIEPMSK, msk.d32, msk.d32);
//
//  if (pdev->cfg.dma_enable == 1U)
//  {
//    dthrctl.d32 = 0U;
//    dthrctl.b.non_iso_thr_en = 1U;
//    dthrctl.b.iso_thr_en = 1U;
//    dthrctl.b.tx_thr_len = 64U;
//    dthrctl.b.rx_thr_en = 1U;
//    dthrctl.b.rx_thr_len = 64U;
//    USB_OTG_WRITE_REG32(&pdev->regs.DREGS->DTHRCTL, dthrctl.d32);
//  }
    /* Clear the DCTL.SftDiscon bit */
    dctl.d32 = USB_OTG_READ_REG32(&pdev->regs.DREGS->DCTL);
    dctl.b.sftdiscon = 0U;
    USB_OTG_WRITE_REG32(&pdev->regs.DREGS->DCTL, dctl.d32);

    USB_OTG_EnableDevInt(pdev);
    return status;
}

/**
 * @brief  USB_OTG_EnableDevInt : Enables the Device mode interrupts
 * @param  [in] pdev     Instance for USB core
 * @retval USB_OTG_STS status
 */
USB_OTG_STS USB_OTG_EnableDevInt(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_STS status = USB_OTG_OK;
    USB_OTG_GINTMSK_TypeDef  intmsk;

    intmsk.d32 = 0UL;

    /* Disable all interrupts. */
    USB_OTG_WRITE_REG32( &pdev->regs.GREGS->GINTMSK, 0UL);
    /* Clear any pending interrupts */
    USB_OTG_WRITE_REG32( &pdev->regs.GREGS->GINTSTS, 0xBFFFFFFFUL);
    /* Enable the common interrupts */
    USB_OTG_EnableCommonInt(pdev);

    if (pdev->cfg.dma_enable == 0U)
    {
        intmsk.b.rxstsqlvl = 1U;
    }

    /* Enable interrupts matching to the Device mode ONLY */
    intmsk.b.usbsuspend = 1UL;
    intmsk.b.usbreset   = 1UL;
    intmsk.b.enumdone   = 1UL;
    intmsk.b.inepintr   = 1UL;
    intmsk.b.outepintr  = 1UL;
    intmsk.b.sofintr    = 1UL;

    intmsk.b.incomplisoin    = 1U;
    intmsk.b.incomplisoout    = 1U;
#ifdef VBUS_SENSING_ENABLED
    intmsk.b.vbusvint    = 1U;
#endif
    USB_OTG_MODIFY_REG32( &pdev->regs.GREGS->GINTMSK, intmsk.d32, intmsk.d32);
    return status;
}

/**
 * @brief  returns the EP Status
 * @param  [in] pdev     Instance for USB core
 * @param  [in] ep       Endpoint structure
 * @retval EP status
 */
uint32_t USB_OTG_GetEPStatus(USB_OTG_CORE_HANDLE *pdev ,USB_OTG_EP *ep)
{
    USB_OTG_DEPCTL_TypeDef  depctl;
    __IO uint32_t *depctl_addr;
    uint32_t Status;

    *(uint32_t*)&depctl.b = 0UL;  /* C-STAT */
    if (ep->is_in == 1U)
    {
        depctl_addr = &(pdev->regs.INEP_REGS[ep->num]->DIEPCTL);
        depctl.b = *(__IO stc_bUSB_OTG_DEPCTL_t*)&USB_OTG_READ_REG32(depctl_addr); /* C-STAT */

        if (depctl.b.stall == 1U)
        {
            Status = USB_OTG_EP_TX_STALL;
        }
        else if (depctl.b.naksts == 1U)
        {
            Status = USB_OTG_EP_TX_NAK;
        }
        else
        {
            Status = USB_OTG_EP_TX_VALID;
        }
    }
    else
    {
        depctl_addr = &(pdev->regs.OUTEP_REGS[ep->num]->DOEPCTL);
        depctl.b = *(__IO stc_bUSB_OTG_DEPCTL_t*)&USB_OTG_READ_REG32(depctl_addr);   /* C-STAT */
        if (depctl.b.stall == 1U)
        {
            Status = USB_OTG_EP_RX_STALL;
        }
        else if (depctl.b.naksts == 1U)
        {
            Status = USB_OTG_EP_RX_NAK;
        }
        else
        {
            Status = USB_OTG_EP_RX_VALID;
        }
    }
    /* Return the current status */
    return Status;
}

/**
 * @brief  enables EP0 OUT to receive SETUP packets and configures EP0
 *   for transmitting packets
 * @param  [in] pdev         USB_OTG_EP0Activate
 * @retval USB_OTG_STS  Status
 */
USB_OTG_STS  USB_OTG_EP0Activate(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_STS             status = USB_OTG_OK;
    USB_OTG_DSTS_TypeDef    dsts;
    USB_OTG_DEPCTL_TypeDef  diepctl;
    USB_OTG_DCTL_TypeDef    dctl;

    dctl.d32 = 0UL;
    /* Read the Device Status and Endpoint 0 Control registers */
    dsts.b = *(__IO stc_bUSB_OTG_DSTS_t*)&USB_OTG_READ_REG32(&pdev->regs.DREGS->DSTS);  /* C-STAT */
    diepctl.d32 = USB_OTG_READ_REG32(&pdev->regs.INEP_REGS[0]->DIEPCTL);
    /* Set the MPS of the IN EP based on the enumeration speed */
    switch (dsts.b.enumspd)
    {
        case DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ:
        case DSTS_ENUMSPD_FS_PHY_30MHZ_OR_60MHZ:
        case DSTS_ENUMSPD_FS_PHY_48MHZ:
            diepctl.b.mps = DEP0CTL_MPS_64;
            break;
        case DSTS_ENUMSPD_LS_PHY_6MHZ:
            diepctl.b.mps = DEP0CTL_MPS_8;
            break;
        default:
            break;
    }
    USB_OTG_WRITE_REG32(&pdev->regs.INEP_REGS[0U]->DIEPCTL, diepctl.d32);
    dctl.b.cgnpinnak = 1U;
    USB_OTG_MODIFY_REG32(&pdev->regs.DREGS->DCTL, dctl.d32, dctl.d32);
    return status;
}


/**
 * @brief  USB_OTG_EPActivate : Activates an EP
 * @param  [in] pdev             Instance for USB core
 * @param  [in] ep               Endpoint
 * @retval USB_OTG_STS      Status
 */
USB_OTG_STS USB_OTG_EPActivate(USB_OTG_CORE_HANDLE *pdev , USB_OTG_EP *ep)
{
    USB_OTG_STS status = USB_OTG_OK;
    USB_OTG_DEPCTL_TypeDef  depctl;
    USB_OTG_DAINT_TypeDef  daintmsk;
    __IO uint32_t *addr;

    *(uint32_t*)&depctl.b = 0UL;   /* C-STAT */
    daintmsk.d32 = 0UL;
    /* Read DEPCTLn register */
    if (ep->is_in == 1U)
    {
        addr = &pdev->regs.INEP_REGS[ep->num]->DIEPCTL;
        daintmsk.ep.in = (uint32_t)1UL << ep->num;
    }
    else
    {
        addr = &pdev->regs.OUTEP_REGS[ep->num]->DOEPCTL;
        daintmsk.ep.out = (uint32_t)1UL << ep->num;
    }
    /* If the EP is already active don't change the EP Control
    * register. */
    depctl.b = *(__IO stc_bUSB_OTG_DEPCTL_t*)&USB_OTG_READ_REG32(addr);   /* C-STAT */
    if (depctl.b.usbactep == 0UL)
    {
        depctl.b.mps    = ep->maxpacket;
        depctl.b.eptype = ep->type;
        depctl.b.txfnum = ep->tx_fifo_num;
        depctl.b.setd0pid = 1U;
        depctl.b.usbactep = 1U;
        USB_OTG_WRITE_REG32(addr, *(uint32_t*)&depctl.d32);   /* C-STAT */
    }
    /* Enable the Interrupt for this EP */
#ifdef USB_OTG_HS_DEDICATED_EP1_ENABLED
    if((ep->num == 1)&&(pdev->cfg.coreID == USB_OTG_HS_CORE_ID))
    {
        USB_OTG_MODIFY_REG32(&pdev->regs.DREGS->DEACHMSK, 0UL, daintmsk.d32);
    }
    else
#endif
    {
        USB_OTG_MODIFY_REG32(&pdev->regs.DREGS->DAINTMSK, 0UL, daintmsk.d32);
    }
    return status;
}


/**
 * @brief  USB_OTG_EPDeactivate : Deactivates an EP
 * @param  [in] pdev             Instance for USB core
 * @param  [in] ep               Endpoint
 * @retval USB_OTG_STS      Status
 */
USB_OTG_STS USB_OTG_EPDeactivate(USB_OTG_CORE_HANDLE *pdev , USB_OTG_EP *ep)
{
    USB_OTG_STS status = USB_OTG_OK;
    USB_OTG_DEPCTL_TypeDef  depctl;
    USB_OTG_DAINT_TypeDef  daintmsk;
    __IO uint32_t *addr;

