Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/src/hc32f4a0_usb_core.c
    depctl.d32 = 0UL;
    daintmsk.d32 = 0UL;
    /* Read DEPCTLn register */
    if (ep->is_in == 1U)
    {
        addr = &pdev->regs.INEP_REGS[ep->num]->DIEPCTL;
        daintmsk.ep.in = (uint32_t)1UL << ep->num;
    }
    else
    {
        addr = &pdev->regs.OUTEP_REGS[ep->num]->DOEPCTL;
        daintmsk.ep.out = (uint32_t)1UL << ep->num;
    }
    depctl.b.usbactep = 0UL;
    USB_OTG_WRITE_REG32(addr, depctl.d32);
    /* Disable the Interrupt for this EP */
#ifdef USB_OTG_HS_DEDICATED_EP1_ENABLED
    if((ep->num == 1U)&&(pdev->cfg.coreID == USB_OTG_HS_CORE_ID))
    {
        USB_OTG_MODIFY_REG32(&pdev->regs.DREGS->DEACHMSK, daintmsk.d32, 0UL);
    }
    else
#endif
    USB_OTG_MODIFY_REG32(&pdev->regs.DREGS->DAINTMSK, daintmsk.d32, 0UL);
    return status;
}


/**
 * @brief  USB_OTG_EPStartXfer : Handle the setup for data xfer for an EP and
 *         starts the xfer
 * @param  [in] pdev             Instance for USB core
 * @param  [in] ep               Endpoint
 * @retval USB_OTG_STS      Status
 */
USB_OTG_STS USB_OTG_EPStartXfer(USB_OTG_CORE_HANDLE *pdev , USB_OTG_EP *ep)
{
    USB_OTG_STS status = USB_OTG_OK;
    USB_OTG_DEPCTL_TypeDef     depctl;
    USB_OTG_DEPXFRSIZ_TypeDef  deptsiz;
    USB_OTG_DSTS_TypeDef       dsts;
    uint32_t fifoemptymsk;

    depctl.d32 = 0UL;
    *(uint32_t*)&deptsiz.b = 0UL;  /* C-STAT */
    /* IN endpoint */
    if (ep->is_in == 1U)
    {
        depctl.d32  = USB_OTG_READ_REG32(&(pdev->regs.INEP_REGS[ep->num]->DIEPCTL));
        deptsiz.b = *(__IO stc_bUSB_OTG_DEPXFRSIZ_t*)&USB_OTG_READ_REG32(&(pdev->regs.INEP_REGS[ep->num]->DIEPTSIZ)); /* C-STAT */
        /* Zero Length Packet? */
        if (ep->xfer_len == 0UL)
        {
            deptsiz.b.xfersize = 0U;
            deptsiz.b.pktcnt = 1U;
        }
        else
        {
            /* Program the transfer size and packet count
            * as follows: xfersize = N * maxpacket +
            * short_packet pktcnt = N + (short_packet
            * exist ? 1 : 0)
            */
            deptsiz.b.xfersize = ep->xfer_len;
            deptsiz.b.pktcnt = (ep->xfer_len - 1U + ep->maxpacket) / ep->maxpacket;

            if (ep->type == EP_TYPE_ISOC)
            {
                deptsiz.b.mc = 1U;
            }
        }
        USB_OTG_WRITE_REG32(&pdev->regs.INEP_REGS[ep->num]->DIEPTSIZ, *(uint32_t*)&deptsiz.b);  /* C-STAT */

        if (pdev->cfg.dma_enable == 1U)
        {
            USB_OTG_WRITE_REG32(&pdev->regs.INEP_REGS[ep->num]->DIEPDMA, ep->dma_addr);
        }
        else
        {
            if (ep->type != EP_TYPE_ISOC)
            {
                /* Enable the Tx FIFO Empty Interrupt for this EP */
                if (ep->xfer_len > 0U)
                {
                    fifoemptymsk = (uint32_t)1UL << ep->num;
                    USB_OTG_MODIFY_REG32(&pdev->regs.DREGS->DIEPEMPMSK, 0UL, fifoemptymsk);
                }
            }
        }

        if (ep->type == EP_TYPE_ISOC)
        {
            dsts.b = *(__IO stc_bUSB_OTG_DSTS_t*)&USB_OTG_READ_REG32(&pdev->regs.DREGS->DSTS);  /* C-STAT */

            if (((dsts.b.soffn)&0x1U) == 0U)
            {
                depctl.b.setd1pid = 1U;
            }
            else
            {
                depctl.b.setd0pid = 1U;
            }
        }

        /* EP enable, IN data in FIFO */
        depctl.b.cnak = 1U;
        depctl.b.epena = 1U;
        USB_OTG_WRITE_REG32(&pdev->regs.INEP_REGS[ep->num]->DIEPCTL, depctl.d32);

        if (ep->type == EP_TYPE_ISOC)
        {
            USB_OTG_WritePacket(pdev, ep->xfer_buff, ep->num, (uint16_t)ep->xfer_len);
        }
    }
    else
    {
        /* OUT endpoint */
        depctl.d32  = USB_OTG_READ_REG32(&(pdev->regs.OUTEP_REGS[ep->num]->DOEPCTL));
        deptsiz.b = *(__IO stc_bUSB_OTG_DEPXFRSIZ_t*)&USB_OTG_READ_REG32(&(pdev->regs.OUTEP_REGS[ep->num]->DOEPTSIZ));  /* C-STAT */
        /* Program the transfer size and packet count as follows:
        * pktcnt = N
        * xfersize = N * maxpacket
        */
        if (ep->xfer_len == 0U)
        {
            deptsiz.b.xfersize = ep->maxpacket;
            deptsiz.b.pktcnt = 1U;
        }
        else
        {
            deptsiz.b.pktcnt = (ep->xfer_len + (ep->maxpacket - 1U)) / ep->maxpacket;
            deptsiz.b.xfersize = deptsiz.b.pktcnt * ep->maxpacket;
            ep->xfer_len = deptsiz.b.xfersize;
        }
        USB_OTG_WRITE_REG32(&pdev->regs.OUTEP_REGS[ep->num]->DOEPTSIZ, *(uint32_t*)&deptsiz.b);  /* C-STAT */

        if (pdev->cfg.dma_enable == 1U)
        {
            USB_OTG_WRITE_REG32(&pdev->regs.OUTEP_REGS[ep->num]->DOEPDMA, ep->dma_addr);
        }

        if (ep->type == EP_TYPE_ISOC)
        {
            if (ep->even_odd_frame != 0U)
            {
                depctl.b.setd1pid = 1U;
            }
            else
            {
                depctl.b.setd0pid = 1U;
            }
        }
        /* EP enable */
        depctl.b.cnak = 1U;
        depctl.b.epena = 1U;
        USB_OTG_WRITE_REG32(&pdev->regs.OUTEP_REGS[ep->num]->DOEPCTL, depctl.d32);
    }
    return status;
}

/**
 * @brief  USB_OTG_EP0StartXfer : Handle the setup for a data xfer for EP0 and
 *         starts the xfer
 * @param  [in] pdev             Instance for USB core
 * @param  [in] ep               Endpoint
 * @retval USB_OTG_STS      Status
 */
USB_OTG_STS USB_OTG_EP0StartXfer(USB_OTG_CORE_HANDLE *pdev , USB_OTG_EP *ep)
{
    USB_OTG_STS                 status = USB_OTG_OK;
    USB_OTG_DEPCTL_TypeDef      depctl;
    USB_OTG_DEP0XFRSIZ_TypeDef  deptsiz;
    USB_OTG_INEPREGS          *in_regs;
    uint32_t fifoemptymsk = 0UL;

    depctl.d32   = 0UL;
    deptsiz.d32  = 0UL;
    /* IN endpoint */
    if (ep->is_in == 1U)
    {
        in_regs = pdev->regs.INEP_REGS[0U];
        depctl.d32  = USB_OTG_READ_REG32(&in_regs->DIEPCTL);
        deptsiz.d32 = USB_OTG_READ_REG32(&in_regs->DIEPTSIZ);
        /* Zero Length Packet? */
        if (ep->xfer_len == 0U)
        {
            deptsiz.b.xfersize = 0U;
            deptsiz.b.pktcnt = 1U;
        }
        else
        {
            if (ep->xfer_len > ep->maxpacket)
            {
                ep->xfer_len = ep->maxpacket;
                deptsiz.b.xfersize = ep->maxpacket;
            }
            else
            {
                deptsiz.b.xfersize = ep->xfer_len;
            }
            deptsiz.b.pktcnt = 1U;
        }
        USB_OTG_WRITE_REG32(&in_regs->DIEPTSIZ, deptsiz.d32);

        if (pdev->cfg.dma_enable == 1U)
        {
            USB_OTG_WRITE_REG32(&pdev->regs.INEP_REGS[ep->num]->DIEPDMA, ep->dma_addr);
        }

        /* EP enable, IN data in FIFO */
        depctl.b.cnak = 1U;
        depctl.b.epena = 1U;
        USB_OTG_WRITE_REG32(&in_regs->DIEPCTL, depctl.d32);

        if (pdev->cfg.dma_enable == 0U)
        {
            /* Enable the Tx FIFO Empty Interrupt for this EP */
            if (ep->xfer_len > 0U)
            {
                fifoemptymsk |= (uint32_t)1UL << ep->num;
                USB_OTG_MODIFY_REG32(&pdev->regs.DREGS->DIEPEMPMSK, 0UL, fifoemptymsk);
            }
        }
    }
    else
    {
        /* OUT endpoint */
        depctl.d32  = USB_OTG_READ_REG32(&pdev->regs.OUTEP_REGS[ep->num]->DOEPCTL);
        deptsiz.d32 = USB_OTG_READ_REG32(&pdev->regs.OUTEP_REGS[ep->num]->DOEPTSIZ);
        /* Program the transfer size and packet count as follows:
        * xfersize = N * (maxpacket + 4 - (maxpacket % 4))
        * pktcnt = N           */
        if (ep->xfer_len == 0U)
        {
            //deptsiz.b.xfersize = ep->maxpacket;
            deptsiz.b.xfersize = 0U;
            deptsiz.b.pktcnt = 1U;
        }
        else
        {
            //ep->xfer_len = ep->maxpacket;
            //deptsiz.b.xfersize = ep->maxpacket;
            ep->xfer_len = __MIN(ep->rem_data_len, ep->maxpacket);
            deptsiz.b.xfersize = ep->xfer_len;
            deptsiz.b.pktcnt = 1U;
        }
        USB_OTG_WRITE_REG32(&pdev->regs.OUTEP_REGS[ep->num]->DOEPTSIZ, deptsiz.d32);
        if (pdev->cfg.dma_enable == 1U)
        {
            USB_OTG_WRITE_REG32(&pdev->regs.OUTEP_REGS[ep->num]->DOEPDMA, ep->dma_addr);
        }
        /* EP enable */
        depctl.b.cnak = 1U;
        depctl.b.epena = 1U;
        USB_OTG_WRITE_REG32 (&(pdev->regs.OUTEP_REGS[ep->num]->DOEPCTL), depctl.d32);
    }
    return status;
}

/**
 * @brief  USB_OTG_EPSetStall : Set the EP STALL
 * @param  [in] pdev             Instance for USB core
 * @param  [in] ep               Endpoint
 * @retval USB_OTG_STS      Status
 */
USB_OTG_STS USB_OTG_EPSetStall(USB_OTG_CORE_HANDLE *pdev , USB_OTG_EP *ep)
{
    USB_OTG_STS status = USB_OTG_OK;
    USB_OTG_DEPCTL_TypeDef  depctl;
    __IO uint32_t *depctl_addr;

    *(uint32_t*)&depctl.b = 0UL; /* C-STAT */
    if (ep->is_in == 1U)
    {
        depctl_addr = &(pdev->regs.INEP_REGS[ep->num]->DIEPCTL);
        depctl.b = *(__IO stc_bUSB_OTG_DEPCTL_t*)&USB_OTG_READ_REG32(depctl_addr);  /* C-STAT */
        /* set the disable and stall bits */
        if (depctl.b.epena != 0U)
        {
            depctl.b.epdis = 1U;
        }
        depctl.b.stall = 1U;
        USB_OTG_WRITE_REG32(depctl_addr, *(uint32_t*)&depctl.b);   /* C-STAT */
    }
    else
    {
        depctl_addr = &(pdev->regs.OUTEP_REGS[ep->num]->DOEPCTL);
        depctl.b = *(__IO stc_bUSB_OTG_DEPCTL_t*)&USB_OTG_READ_REG32(depctl_addr);  /* C-STAT */
        /* set the stall bit */
        depctl.b.stall = 1U;
        USB_OTG_WRITE_REG32(depctl_addr, *(uint32_t*)&depctl.b);/* C-STAT */
    }
    return status;
}


/**
 * @brief  Clear the EP STALL
 * @param  [in] pdev             Instance for USB core
 * @param  [in] ep               Endpoint
 * @retval USB_OTG_STS      Status
 */
USB_OTG_STS USB_OTG_EPClearStall(USB_OTG_CORE_HANDLE *pdev , USB_OTG_EP *ep)
{
    USB_OTG_STS status = USB_OTG_OK;
    USB_OTG_DEPCTL_TypeDef  depctl;
    __IO uint32_t *depctl_addr;

