Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/src/hc32f4a0_usb_core.c
    depctl.d32 = 0UL;

    if (ep->is_in == 1U)
    {
        depctl_addr = &(pdev->regs.INEP_REGS[ep->num]->DIEPCTL);
    }
    else
    {
        depctl_addr = &(pdev->regs.OUTEP_REGS[ep->num]->DOEPCTL);
    }
    depctl.d32 = USB_OTG_READ_REG32(depctl_addr);
    /* clear the stall bits */
    depctl.b.stall = 0U;
    if ((ep->type == EP_TYPE_INTR) || (ep->type == EP_TYPE_BULK))
    {
        depctl.b.setd0pid = 1U; /* DATA0 */
    }
    USB_OTG_WRITE_REG32(depctl_addr, depctl.d32);
    return status;
}
/**
 * @brief  USB_OTG_ReadDevAllOutEp_itr : returns OUT endpoint interrupt bits
 * @param  [in] pdev : Instance for USB core
 * @retval OUT endpoint interrupt bits
 */
uint32_t USB_OTG_ReadDevAllOutEp_itr(USB_OTG_CORE_HANDLE *pdev)
{
    uint32_t v;
    v  = USB_OTG_READ_REG32(&pdev->regs.DREGS->DAINT);
    v &= USB_OTG_READ_REG32(&pdev->regs.DREGS->DAINTMSK);
    return ((v & 0xFFFF0000UL) >> 16U);
}


/**
 * @brief  USB_OTG_ReadDevOutEP_itr : returns Device OUT EP Interrupt register
 * @param  [in] pdev     Instance for USB core
 * @param  [in] epnum    Endpoint number
 * @retval Device OUT EP Interrupt register
 */
uint32_t USB_OTG_ReadDevOutEP_itr(USB_OTG_CORE_HANDLE *pdev , uint8_t epnum)
{
    uint32_t v;
    v  = USB_OTG_READ_REG32(&pdev->regs.OUTEP_REGS[epnum]->DOEPINT);
    v &= USB_OTG_READ_REG32(&pdev->regs.DREGS->DOEPMSK);
    return v;
}


/**
 * @brief  USB_OTG_ReadDevAllInEPItr : Get int status register
 * @param  [in] pdev : Instance for USB core
 * @retval int status register
 */
uint32_t USB_OTG_ReadDevAllInEPItr(USB_OTG_CORE_HANDLE *pdev)
{
    uint32_t v;
    v = USB_OTG_READ_REG32(&pdev->regs.DREGS->DAINT);
    v &= USB_OTG_READ_REG32(&pdev->regs.DREGS->DAINTMSK);
    return (v & 0xFFFFUL);
}

/**
 * @brief  configures EPO to receive SETUP packets
 * @param  [in] pdev     Instance for USB core
 * @retval None
 */
void USB_OTG_EP0_OutStart(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_DEP0XFRSIZ_TypeDef  doeptsize0;

    doeptsize0.d32 = 0UL;
    doeptsize0.b.supcnt = 3U;
    doeptsize0.b.pktcnt = 1U;

    doeptsize0.b.xfersize = 64U;
    pdev->dev.out_ep[0].xfer_len = 64U;
    pdev->dev.out_ep[0].rem_data_len = 64U;
    pdev->dev.out_ep[0].total_data_len = 64U;
    USB_OTG_WRITE_REG32( &pdev->regs.OUTEP_REGS[0U]->DOEPTSIZ, doeptsize0.d32 );
    pdev->dev.ep0_state = USB_OTG_EP0_IDLE;

    if (pdev->cfg.dma_enable == 1U)
    {
        USB_OTG_DEPCTL_TypeDef  doepctl;
        doepctl.d32 = 0UL;
        USB_OTG_WRITE_REG32( &pdev->regs.OUTEP_REGS[0]->DOEPDMA, (uint32_t)&pdev->dev.setup_packet);

        /* EP enable */
        doepctl.d32 = USB_OTG_READ_REG32(&pdev->regs.OUTEP_REGS[0]->DOEPCTL);
        doepctl.b.epena = 1U;
        doepctl.d32 = 0x80008000UL;
        USB_OTG_WRITE_REG32( &pdev->regs.OUTEP_REGS[0U]->DOEPCTL, doepctl.d32);
    }
}
/**
 * @brief  USB_OTG_RemoteWakeup : active remote wakeup signalling
 * @param  [in] pdev     Instance for USB core
 * @retval None
 */
void USB_OTG_ActiveRemoteWakeup(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_DCTL_TypeDef     dctl;
    USB_OTG_DSTS_TypeDef     dsts;
    USB_OTG_PCGCCTL_TypeDef  power;

    if (pdev->dev.DevRemoteWakeup != 0UL)
    {
        dsts.b = *(__IO stc_bUSB_OTG_DSTS_t*)&USB_OTG_READ_REG32(&pdev->regs.DREGS->DSTS);  /* C-STAT */
        if(dsts.b.suspsts == 1U)
        {
            if(pdev->cfg.low_power != 0U)
            {
                /* un-gate USB Core clock */
                power.d32 = USB_OTG_READ_REG32(&pdev->regs.PCGCCTL);
                power.b.gatehclk = 0U;
                power.b.stoppclk = 0U;
                USB_OTG_WRITE_REG32(pdev->regs.PCGCCTL, power.d32);
            }
        }
    }
    /* active Remote wakeup signaling */
    dctl.d32 = 0U;
    dctl.b.rmtwkupsig = 1U;
    USB_OTG_MODIFY_REG32(&pdev->regs.DREGS->DCTL, 0UL, dctl.d32);
    USB_OTG_BSP_mDelay(5UL);
    USB_OTG_MODIFY_REG32(&pdev->regs.DREGS->DCTL, dctl.d32, 0UL );
}
/**
 * @brief  Set the EP Status
 * @param  [in] pdev     Instance for USB core
 * @param  [in] Status   New Status
 * @param  [in] ep       EP structure
 * @retval None
 */
void USB_OTG_SetEPStatus (USB_OTG_CORE_HANDLE *pdev , USB_OTG_EP *ep , uint32_t Status)
{
    USB_OTG_DEPCTL_TypeDef  depctl;
    __IO uint32_t *depctl_addr;
    uint8_t u8RetFlag = 0U;

    *(uint32_t*)&depctl.b = 0UL; /* C-STAT */

    /* Process for IN endpoint */
    if (ep->is_in == 1U)
    {
        depctl_addr = &(pdev->regs.INEP_REGS[ep->num]->DIEPCTL);
        depctl.b = *(__IO stc_bUSB_OTG_DEPCTL_t*)&USB_OTG_READ_REG32(depctl_addr);   /* C-STAT */

        if (Status == USB_OTG_EP_TX_STALL)
        {
            USB_OTG_EPSetStall(pdev, ep);
            u8RetFlag = 1U;   //return;
        }
        else if (Status == USB_OTG_EP_TX_NAK)
        {
            depctl.b.snak = 1U;
        }
        else if (Status == USB_OTG_EP_TX_VALID)
        {
            if (depctl.b.stall == 1U)
            {
                ep->even_odd_frame = 0U;
                USB_OTG_EPClearStall(pdev, ep);
                u8RetFlag = 1U;   //return;
            }
            depctl.b.cnak = 1U;
            depctl.b.usbactep = 1U;
            depctl.b.epena = 1U;
        }
        else if (Status == USB_OTG_EP_TX_DIS)
        {
            depctl.b.usbactep = 0U;
        }
        else
        {
            //else
            ;
        }
    }
    else /* Process for OUT endpoint */
    {
        depctl_addr = &(pdev->regs.OUTEP_REGS[ep->num]->DOEPCTL);
        depctl.b = *(__IO stc_bUSB_OTG_DEPCTL_t*)&USB_OTG_READ_REG32(depctl_addr);  /* C-STAT */

        if (Status == USB_OTG_EP_RX_STALL)
        {
            depctl.b.stall = 1U;
        }
        else if (Status == USB_OTG_EP_RX_NAK)
        {
            depctl.b.snak = 1U;
        }
        else if (Status == USB_OTG_EP_RX_VALID)
        {
            if (depctl.b.stall == 1U)
            {
                ep->even_odd_frame = 0U;
                USB_OTG_EPClearStall(pdev, ep);
                u8RetFlag = 1U; //return;
            }
            depctl.b.cnak = 1U;
            depctl.b.usbactep = 1U;
            depctl.b.epena = 1U;
        }
        else if (Status == USB_OTG_EP_RX_DIS)
        {
            depctl.b.usbactep = 0U;
        }
        else
        {
            //else
            ;
        }
    }

