Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/src/hc32f4a0_usb_core.c
    if(1U != u8RetFlag)
    {
        USB_OTG_WRITE_REG32(depctl_addr, *(uint32_t*)&depctl.b);  /* C-STAT */
    }
}


#ifdef USE_HOST_MODE
/**
 * @brief  USB_OTG_CoreInitHost : Initializes USB_OTG controller for host mode
 * @param  [in] pdev     Instance for USB core
 * @retval status
 */
USB_OTG_STS USB_OTG_CoreInitHost(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_STS                     status = USB_OTG_OK;
    USB_OTG_FSIZ_TypeDef            nptxfifosize;
    USB_OTG_FSIZ_TypeDef            ptxfifosize;
    USB_OTG_HCFG_TypeDef            hcfg;

#ifdef USE_OTG_MODE
    USB_OTG_GOTGCTL_TypeDef          gotgctl;
#endif
    uint32_t                        i = 0UL;
    nptxfifosize.d32 = 0UL;
    ptxfifosize.d32 = 0UL;
#ifdef USE_OTG_MODE
    gotgctl.d32 = 0UL;
#endif
    hcfg.d32 = 0UL;

    /* configure charge pump IO */
    USB_OTG_BSP_ConfigVBUS(pdev);

    /* Restart the Phy Clock */
    USB_OTG_WRITE_REG32(pdev->regs.PCGCCTL, 0UL);

    /* Initialize Host Configuration Register */
    if (pdev->cfg.phy_itface == USB_OTG_ULPI_PHY)
    {
        USB_OTG_InitFSLSPClkSel(pdev , HCFG_30_60_MHZ);
        //USB_OTG_InitFSLSPClkSel(pdev , HCFG_48_MHZ);
    }
    else
    {
        //USB_OTG_InitFSLSPClkSel(pdev , HCFG_48_MHZ);
        USB_OTG_InitFSLSPClkSel(pdev , HCFG_6_MHZ);
    }
    USB_OTG_ResetPort(pdev);

    hcfg.d32 = USB_OTG_READ_REG32(&pdev->regs.HREGS->HCFG);
    hcfg.b.fslssupp = 0U;
    USB_OTG_WRITE_REG32(&pdev->regs.HREGS->HCFG, hcfg.d32);

    /* Configure data FIFO sizes */
    /* Rx FIFO */
#ifdef USB_OTG_FS_CORE
    if(pdev->cfg.coreID == USB_OTG_FS_CORE_ID)
    {
        /* set Rx FIFO size */
        USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GRXFSIZ, (uint32_t)RX_FIFO_FS_SIZE);
        nptxfifosize.b.startaddr = RX_FIFO_FS_SIZE;
        nptxfifosize.b.depth = TXH_NP_FS_FIFOSIZ;
        USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GNPTXFSIZ, nptxfifosize.d32);

        ptxfifosize.b.startaddr = RX_FIFO_FS_SIZE + TXH_NP_FS_FIFOSIZ;
        ptxfifosize.b.depth     = TXH_P_FS_FIFOSIZ;
        USB_OTG_WRITE_REG32(&pdev->regs.GREGS->HPTXFSIZ, ptxfifosize.d32);
    }
#endif
#ifdef USB_OTG_HS_CORE
    if (pdev->cfg.coreID == USB_OTG_HS_CORE_ID)
    {
        /* set Rx FIFO size */
        USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GRXFSIZ, RX_FIFO_HS_SIZE);
        nptxfifosize.b.startaddr = RX_FIFO_HS_SIZE;
        nptxfifosize.b.depth = TXH_NP_HS_FIFOSIZ;
        USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GNPTXFSIZ, nptxfifosize.d32);

        ptxfifosize.b.startaddr = RX_FIFO_HS_SIZE + TXH_NP_HS_FIFOSIZ;
        ptxfifosize.b.depth     = TXH_P_HS_FIFOSIZ;
        USB_OTG_WRITE_REG32(&pdev->regs.GREGS->HPTXFSIZ, ptxfifosize.d32);
    }
#endif

#ifdef USE_OTG_MODE
    /* Clear Host Set HNP Enable in the USB_OTG Control Register */
    gotgctl.b.hstsethnpen = 1U;
    USB_OTG_MODIFY_REG32( &pdev->regs.GREGS->GOTGCTL, gotgctl.d32, 0U);
#endif

    /* Make sure the FIFOs are flushed. */
    USB_OTG_FlushTxFifo(pdev, 0x10UL);         /* all Tx FIFOs */
    USB_OTG_FlushRxFifo(pdev);

    /* Clear all pending HC Interrupts */
    for (i = 0UL; i < pdev->cfg.host_channels; i++)
    {
        USB_OTG_WRITE_REG32( &pdev->regs.HC_REGS[i]->HCINT, 0xFFFFFFFFUL );
        USB_OTG_WRITE_REG32( &pdev->regs.HC_REGS[i]->HCINTMSK, 0UL );
    }
#ifndef USE_OTG_MODE
    USB_OTG_DriveVbus(pdev, 1U);
#endif

    USB_OTG_EnableHostInt(pdev);
    return status;
}

/**
 * @brief  USB_OTG_DriveVbus : set/reset vbus
 * @param  [in] pdev         Instance for USB core
 * @param  [in] state        VBUS state
 * @retval None
 */
void USB_OTG_DriveVbus (USB_OTG_CORE_HANDLE *pdev, uint8_t state)
{
    USB_OTG_HPRT0_TypeDef     hprt0;
    uint32_t u32ReadHprtTemp = 0UL;  /* C-STAT */

    *(uint32_t*)&hprt0.b = 0UL;  /* C-STAT */

    /* enable disable the external charge pump */
    USB_OTG_BSP_DriveVBUS(pdev, state);

    /* Turn on the Host port power. */
    //hprt0.d32 = USB_OTG_ReadHPRT0(pdev);  /* C-STAT */
    u32ReadHprtTemp = USB_OTG_ReadHPRT0(pdev);
    hprt0.b = *(stc_bUSB_OTG_HPRT0_t*)&u32ReadHprtTemp; /* C-STAT */

    if ((hprt0.b.prtpwr == 0U ) && (state == 1U ))
    {
        hprt0.b.prtpwr = 1U;
        USB_OTG_WRITE_REG32(pdev->regs.HPRT0, *(uint32_t*)&hprt0.b);  /* C-STAT */
    }
    if ((hprt0.b.prtpwr == 1U ) && (state == 0U ))
    {
        hprt0.b.prtpwr = 0U;
        USB_OTG_WRITE_REG32(pdev->regs.HPRT0, *(uint32_t*)&hprt0.b);   /* C-STAT */
    }

    USB_OTG_BSP_mDelay(200UL);
}

/**
 * @brief  USB_OTG_EnableHostInt: Enables the Host mode interrupts
 * @param  [in] pdev     Instance for USB core
 * @retval USB_OTG_STS status
 */
USB_OTG_STS USB_OTG_EnableHostInt(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_STS       status = USB_OTG_OK;
    USB_OTG_GINTMSK_TypeDef  intmsk;
    intmsk.d32 = 0UL;
    /* Disable all interrupts. */
    USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GINTMSK, 0UL);

    /* Clear any pending interrupts. */
    USB_OTG_WRITE_REG32(&pdev->regs.GREGS->GINTSTS, 0xFFFFFFFFUL);

    /* Enable the common interrupts */
    USB_OTG_EnableCommonInt(pdev);

    if (pdev->cfg.dma_enable == 0U)
    {
        intmsk.b.rxstsqlvl  = 1U;
    }
    intmsk.b.portintr   = 1U;
    intmsk.b.hcintr     = 1U;
    intmsk.b.disconnect = 1U;
    intmsk.b.sofintr    = 1U;
    intmsk.b.incomplisoout  = 1U;
    USB_OTG_MODIFY_REG32(&pdev->regs.GREGS->GINTMSK, intmsk.d32, intmsk.d32);
    return status;
}


/**
 * @brief  USB_OTG_ReadHPRT0 : Reads HPRT0 to modify later
 * @param  [in] pdev     Instance for USB core
 * @retval HPRT0 value
 */
uint32_t USB_OTG_ReadHPRT0(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_HPRT0_TypeDef  hprt0;

    hprt0.d32 = USB_OTG_READ_REG32(pdev->regs.HPRT0);
    hprt0.b.prtena = 0U;
    hprt0.b.prtconndet = 0U;
    hprt0.b.prtenchng = 0U;
    hprt0.b.prtovrcurrchng = 0U;
    return hprt0.d32;
}

/**
 * @brief  USB_OTG_ReadHostAllChannels_intr : Register PCD Callbacks
 * @param  [in] pdev     Instance for USB core
 * @retval Status
 */
uint32_t USB_OTG_ReadHostAllChannels_intr (USB_OTG_CORE_HANDLE *pdev)
{
    return (USB_OTG_READ_REG32 (&pdev->regs.HREGS->HAINT));
}

/**
 * @brief  USB_OTG_ResetPort : Reset Host Port
 * @param  [in] pdev     Instance for USB core
 * @retval status
 * @note    (1)The application must wait at least 10 ms (+ 10 ms security)
 *   before clearing the reset bit.
 */
uint32_t USB_OTG_ResetPort(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_HPRT0_TypeDef  hprt0;

    hprt0.d32 = USB_OTG_ReadHPRT0(pdev);
    hprt0.b.prtrst = 1U;
    USB_OTG_WRITE_REG32(pdev->regs.HPRT0, hprt0.d32);
    USB_OTG_BSP_mDelay (10UL);                                /* See Note #1 */
    hprt0.b.prtrst = 0U;
    USB_OTG_WRITE_REG32(pdev->regs.HPRT0, hprt0.d32);
    USB_OTG_BSP_mDelay (20UL);
    return 1UL;
}
uint32_t USB_OTG_testmode(USB_OTG_CORE_HANDLE *pdev,int mode)
{
    USB_OTG_HPRT0_TypeDef  hprt0;

    hprt0.d32 = USB_OTG_ReadHPRT0(pdev);
    hprt0.b.prttstctl = (uint32_t)mode;
    USB_OTG_WRITE_REG32(pdev->regs.HPRT0, hprt0.d32);
#if (DDL_PRINT_ENABLE == DDL_ON)
    printf("test mode stated\n");
#endif
    return 1UL;
}

/**
 * @brief  USB_OTG_HC_Init : Prepares a host channel for transferring packets
 * @param  [in] pdev     Instance for USB core
 * @param  [in] hc_num   Channel number
 * @retval USB_OTG_STS status
 */
USB_OTG_STS USB_OTG_HC_Init(USB_OTG_CORE_HANDLE *pdev , uint8_t hc_num)
{
    USB_OTG_STS status = USB_OTG_OK;
    uint32_t intr_enable = 0UL;
    USB_OTG_HCINTMSK_TypeDef  hcintmsk;
    USB_OTG_GINTMSK_TypeDef    gintmsk;
    USB_OTG_HCCHAR_TypeDef     hcchar;
    USB_OTG_HCINTn_TypeDef     hcint;

    gintmsk.d32 = 0UL;
    hcintmsk.d32 = 0UL;
    hcchar.d32 = 0UL;

