Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/src/hc32f4a0_usb_core.c
    /* Clear old interrupt conditions for this host channel. */
    hcint.d32 = 0xFFFFFFFFUL;
    USB_OTG_WRITE_REG32(&pdev->regs.HC_REGS[hc_num]->HCINT, hcint.d32);

    /* Enable channel interrupts required for this transfer. */
    hcintmsk.d32 = 0UL;

    if (pdev->cfg.dma_enable == 1U)
    {
        hcintmsk.b.ahberr = 1U;
    }

    switch (pdev->host.hc[hc_num].ep_type)
    {
        case EP_TYPE_CTRL:
        case EP_TYPE_BULK:
            hcintmsk.b.xfercompl = 1U;
            hcintmsk.b.stall = 1U;
            hcintmsk.b.xacterr = 1U;
            hcintmsk.b.datatglerr = 1U;
            hcintmsk.b.nak = 1U;
            if (pdev->host.hc[hc_num].ep_is_in)
            {
                hcintmsk.b.bblerr = 1U;
            }
            else
            {
                hcintmsk.b.nyet = 1U;
                if (pdev->host.hc[hc_num].do_ping)
                {
                    hcintmsk.b.ack = 1U;
                }
            }
            break;
        case EP_TYPE_INTR:
            hcintmsk.b.xfercompl = 1U;
            hcintmsk.b.nak = 1U;
            hcintmsk.b.stall = 1U;
            hcintmsk.b.xacterr = 1U;
            hcintmsk.b.datatglerr = 1U;
            hcintmsk.b.frmovrun = 1U;

            if (pdev->host.hc[hc_num].ep_is_in)
            {
                hcintmsk.b.bblerr = 1U;
            }
            break;
        case EP_TYPE_ISOC:
            hcintmsk.b.xfercompl = 1U;
            hcintmsk.b.frmovrun = 1U;
            hcintmsk.b.ack = 1U;

            if (pdev->host.hc[hc_num].ep_is_in)
            {
                hcintmsk.b.xacterr = 1U;
                hcintmsk.b.bblerr = 1U;
            }
            break;
    }

    USB_OTG_WRITE_REG32(&pdev->regs.HC_REGS[hc_num]->HCINTMSK, hcintmsk.d32);

    /* Enable the top level host channel interrupt. */
    intr_enable = ((uint32_t)1 << hc_num);
    USB_OTG_MODIFY_REG32(&pdev->regs.HREGS->HAINTMSK, 0UL, intr_enable);

    /* Make sure host channel interrupts are enabled. */
    gintmsk.b.hcintr = 1UL;
    USB_OTG_MODIFY_REG32(&pdev->regs.GREGS->GINTMSK, 0UL, gintmsk.d32);

    /* Program the HCCHAR register */
    hcchar.d32 = 0UL;
    hcchar.b.devaddr = pdev->host.hc[hc_num].dev_addr;
    hcchar.b.epnum   = pdev->host.hc[hc_num].ep_num;
    hcchar.b.epdir   = pdev->host.hc[hc_num].ep_is_in;
    hcchar.b.lspddev = (pdev->host.hc[hc_num].speed == HPRT0_PRTSPD_LOW_SPEED);
    hcchar.b.eptype  = pdev->host.hc[hc_num].ep_type;
    hcchar.b.mps     = pdev->host.hc[hc_num].max_packet;
    if (pdev->host.hc[hc_num].ep_type == HCCHAR_INTR)
    {
        hcchar.b.oddfrm  = 1U;
    }
    USB_OTG_WRITE_REG32(&pdev->regs.HC_REGS[hc_num]->HCCHAR, hcchar.d32);
    return status;
}

/**
 * @brief  USB_OTG_HC_StartXfer : Start transfer
 * @param  [in] pdev     Instance for USB core
 * @param  [in] hc_num   Channel number
 * @retval USB_OTG_STS status
 */
USB_OTG_STS USB_OTG_HC_StartXfer(USB_OTG_CORE_HANDLE *pdev , uint8_t hc_num)
{
    USB_OTG_STS status = USB_OTG_OK;
    USB_OTG_HCCHAR_TypeDef   hcchar;
    USB_OTG_HCTSIZn_TypeDef  hctsiz;
    USB_OTG_HNPTXSTS_TypeDef hnptxsts;
    USB_OTG_HPTXSTS_TypeDef  hptxsts;
    USB_OTG_GINTMSK_TypeDef  intmsk;
    uint16_t                 len_words = 0U;

    uint16_t num_packets;
    uint16_t max_hc_pkt_count;

    max_hc_pkt_count = 256U;
    hctsiz.d32 = 0UL;
    hcchar.d32 = 0UL;
    intmsk.d32 = 0UL;

    /* Compute the expected number of packets associated to the transfer */
    if (pdev->host.hc[hc_num].xfer_len > 0U)
    {
        num_packets = (uint16_t)((pdev->host.hc[hc_num].xfer_len + \
        (uint32_t)pdev->host.hc[hc_num].max_packet - 1UL) / (uint32_t)pdev->host.hc[hc_num].max_packet);

        if (num_packets > max_hc_pkt_count)
        {
            num_packets = max_hc_pkt_count;
            pdev->host.hc[hc_num].xfer_len = (uint32_t)num_packets * \
            (uint32_t)pdev->host.hc[hc_num].max_packet;
        }
    }
    else
    {
        num_packets = 1U;
    }
    if (pdev->host.hc[hc_num].ep_is_in)
    {
        pdev->host.hc[hc_num].xfer_len = (uint32_t)num_packets * \
        (uint32_t)pdev->host.hc[hc_num].max_packet;
    }
    /* Initialize the HCTSIZn register */
    hctsiz.b.xfersize = pdev->host.hc[hc_num].xfer_len;
    hctsiz.b.pktcnt = num_packets;
    hctsiz.b.pid = pdev->host.hc[hc_num].data_pid;
    USB_OTG_WRITE_REG32(&pdev->regs.HC_REGS[hc_num]->HCTSIZ, hctsiz.d32);

    if (pdev->cfg.dma_enable == 1U)
    {
        USB_OTG_WRITE_REG32(&pdev->regs.HC_REGS[hc_num]->HCDMA, (unsigned int)pdev->host.hc[hc_num].xfer_buff);
    }

    hcchar.d32 = USB_OTG_READ_REG32(&pdev->regs.HC_REGS[hc_num]->HCCHAR);
    hcchar.b.oddfrm = USB_OTG_IsEvenFrame(pdev);

    /* Set host channel enable */
    hcchar.b.chen = 1U;
    hcchar.b.chdis = 0U;
    USB_OTG_WRITE_REG32(&pdev->regs.HC_REGS[hc_num]->HCCHAR, hcchar.d32);

    if (pdev->cfg.dma_enable == 0U) /* Slave mode */
    {
        if((pdev->host.hc[hc_num].ep_is_in == 0U) && (pdev->host.hc[hc_num].xfer_len > 0U))
        {
            switch(pdev->host.hc[hc_num].ep_type)
            {
                /* Non periodic transfer */
                case EP_TYPE_CTRL:
                case EP_TYPE_BULK:
                    hnptxsts.b = *(__IO stc_bUSB_OTG_HNPTXSTS_t*)&USB_OTG_READ_REG32(&pdev->regs.GREGS->GNPTXSTS);  /* C-STAT */
                    len_words = (uint16_t)((pdev->host.hc[hc_num].xfer_len + 3UL) / 4UL);

                    /* check if there is enough space in FIFO space */
                    if(len_words > hnptxsts.b.nptxfspcavail)
                    {
                        /* need to process data in nptxfempty interrupt */
                        intmsk.b.nptxfempty = 1U;
                        USB_OTG_MODIFY_REG32( &pdev->regs.GREGS->GINTMSK, 0UL, intmsk.d32);
                    }
                    break;
                /* Periodic transfer */
                case EP_TYPE_INTR:
                case EP_TYPE_ISOC:
                    hptxsts.b = *(__IO stc_bUSB_OTG_HPTXSTS_t*)&USB_OTG_READ_REG32(&pdev->regs.HREGS->HPTXSTS);   /* C-STAT */
                    len_words = (uint16_t)((pdev->host.hc[hc_num].xfer_len + 3UL) / 4UL);
                    /* check if there is enough space in FIFO space */
                    if(len_words > hptxsts.b.ptxfspcavail) /* split the transfer */
                    {
                        /* need to process data in ptxfempty interrupt */
                        intmsk.b.ptxfempty = 1U;
                        USB_OTG_MODIFY_REG32( &pdev->regs.GREGS->GINTMSK, 0UL, intmsk.d32);
                    }
                    break;
                default:
                    break;
            }

