Mmatsnev/hc32f4a0/DeviceDriverLibrary/hc32f4a0_ddl/driver/src/hc32f4a0_usb_core.c
            /* Write packet into the Tx FIFO. */
            USB_OTG_WritePacket(pdev,
            pdev->host.hc[hc_num].xfer_buff ,
            hc_num, (uint16_t)pdev->host.hc[hc_num].xfer_len);
        }
    }
    return status;
}

/**
 * @brief  USB_OTG_HC_Halt : Halt channel
 * @param  [in] pdev     Instance for USB core
 * @param  [in] hc_num   Channel number
 * @retval USB_OTG_STS status
 */
USB_OTG_STS USB_OTG_HC_Halt(USB_OTG_CORE_HANDLE *pdev , uint8_t hc_num)
{
    USB_OTG_STS status = USB_OTG_OK;
    USB_OTG_HNPTXSTS_TypeDef            nptxsts;
    USB_OTG_HPTXSTS_TypeDef             hptxsts;
    USB_OTG_HCCHAR_TypeDef              hcchar;

    *(uint32_t*)&nptxsts.b = 0UL;  /* C-STAT */
    *(uint32_t*)&hptxsts.b = 0UL;  /* C-STAT */
    hcchar.b = *(__IO stc_bUSB_OTG_HCCHAR_t*)&USB_OTG_READ_REG32(&pdev->regs.HC_REGS[hc_num]->HCCHAR);  /* C-STAT */
    hcchar.b.chen = 1U;
    hcchar.b.chdis = 1U;

    /* Check for space in the request queue to issue the halt. */
    if ((hcchar.b.eptype == HCCHAR_CTRL) || (hcchar.b.eptype == HCCHAR_BULK))
    {
        nptxsts.b = *(__IO stc_bUSB_OTG_HNPTXSTS_t*)&USB_OTG_READ_REG32(&pdev->regs.GREGS->GNPTXSTS);  /* C-STAT */
        if (nptxsts.b.nptxqspcavail == 0U)
        {
            hcchar.b.chen = 0U;
        }
    }
    else
    {
        hptxsts.b = *(__IO stc_bUSB_OTG_HPTXSTS_t*)&USB_OTG_READ_REG32(&pdev->regs.HREGS->HPTXSTS);  /* C-STAT */
        if (hptxsts.b.ptxqspcavail == 0U)
        {
            hcchar.b.chen = 0U;
        }
    }
    USB_OTG_WRITE_REG32(&pdev->regs.HC_REGS[hc_num]->HCCHAR, *(uint32_t*)&hcchar.b);  /* C-STAT */
    return status;
}

/**
 * @brief  Issue a ping token
 * @param  [in] pdev     Instance for USB core
 * @param  [in] hc_num   Channel number
 * @retval None
 */
USB_OTG_STS USB_OTG_HC_DoPing(USB_OTG_CORE_HANDLE *pdev , uint8_t hc_num)
{
    USB_OTG_STS               status = USB_OTG_OK;
    USB_OTG_HCCHAR_TypeDef    hcchar;
    USB_OTG_HCTSIZn_TypeDef   hctsiz;

    hctsiz.d32 = 0UL;
    hctsiz.b.dopng = 1U;
    hctsiz.b.pktcnt = 1U;
    USB_OTG_WRITE_REG32(&pdev->regs.HC_REGS[hc_num]->HCTSIZ, hctsiz.d32);

    hcchar.d32 = USB_OTG_READ_REG32(&pdev->regs.HC_REGS[hc_num]->HCCHAR);
    hcchar.b.chen = 1U;
    hcchar.b.chdis = 0U;
    USB_OTG_WRITE_REG32(&pdev->regs.HC_REGS[hc_num]->HCCHAR, hcchar.d32);
    return status;
}


/**
 * @brief  USB_OTG_IsHostMode : Check if it is host mode
 * @param  [in] pdev     Instance for USB core
 * @retval num_in_ep
 */
uint8_t USB_OTG_IsHostMode(USB_OTG_CORE_HANDLE *pdev)
{
    return (USB_OTG_GetMode(pdev) == HOST_MODE);
}

/**
 * @brief  USB_OTG_IsEvenFrame
*          This function returns the frame number for sof packet
 * @param  [in] pdev     Instance for USB core
 * @retval Frame number
 */
uint8_t USB_OTG_IsEvenFrame (USB_OTG_CORE_HANDLE *pdev)
{
    return !(USB_OTG_READ_REG32(&pdev->regs.HREGS->HFNUM) & 0x1U);
}

/**
 * @brief  USB_OTG_InitFSLSPClkSel : Initializes the FSLSPClkSel field of the
 *         HCFG register on the PHY type
 * @param  [in] pdev     Instance for USB core
 * @param  [in] freq     Clock frequency
 * @retval None
 */
void USB_OTG_InitFSLSPClkSel(USB_OTG_CORE_HANDLE *pdev , uint8_t freq)
{
    USB_OTG_HCFG_TypeDef   hcfg;

    hcfg.d32 = USB_OTG_READ_REG32(&pdev->regs.HREGS->HCFG);
    hcfg.b.fslspclksel = freq;
    USB_OTG_WRITE_REG32(&pdev->regs.HREGS->HCFG, hcfg.d32);
}

/**
 * @brief  Stop the device and clean up fifo's
 * @param  [in] pdev     Instance for USB core
 * @retval None
 */
void USB_OTG_StopHost(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_HCCHAR_TypeDef  hcchar;
    uint32_t                i;

    USB_OTG_WRITE_REG32(&pdev->regs.HREGS->HAINTMSK , 0UL);
    USB_OTG_WRITE_REG32(&pdev->regs.HREGS->HAINT, 0xFFFFFFFFUL);
    /* Flush out any leftover queued requests. */
    for (i = 0UL; i < pdev->cfg.host_channels; i++)
    {
        hcchar.d32 = USB_OTG_READ_REG32(&pdev->regs.HC_REGS[i]->HCCHAR);
        hcchar.b.chen = 0U;
        hcchar.b.chdis = 1U;
        hcchar.b.epdir = 0U;
        USB_OTG_WRITE_REG32(&pdev->regs.HC_REGS[i]->HCCHAR, hcchar.d32);
    }

    /* Flush the FIFO */
    USB_OTG_FlushRxFifo(pdev);
    USB_OTG_FlushTxFifo(pdev, 0x10UL);
}
void USB_OTG_PRTSUSP(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_HPRT0_TypeDef     port0;
    USB_OTG_PCGCCTL_TypeDef   power;

    port0.d32 = USB_OTG_ReadHPRT0(pdev);
    port0.b.prtsusp = 1U;
    port0.b.prtres = 0U;
    USB_OTG_WRITE_REG32(pdev->regs.HPRT0, port0.d32);

    /* Low power mode */
    power.d32 = USB_OTG_READ_REG32(&pdev->regs.PCGCCTL);
    power.b.stoppclk = 1U;
    USB_OTG_WRITE_REG32(pdev->regs.PCGCCTL, power.d32);
    power.b.gatehclk = 1U;
    USB_OTG_WRITE_REG32(pdev->regs.PCGCCTL, power.d32);
}

void USB_OTG_ACTIVE_WAKEUP(USB_OTG_CORE_HANDLE *pdev)
{
    USB_OTG_HPRT0_TypeDef     port0;
    USB_OTG_PCGCCTL_TypeDef   power;
    /* Release low power mode */
    power.d32 = USB_OTG_READ_REG32(&pdev->regs.PCGCCTL);
    power.b.gatehclk = 0U;
    power.b.stoppclk = 0U;
    USB_OTG_WRITE_REG32(pdev->regs.PCGCCTL, power.d32);

    USB_OTG_BSP_mDelay(1UL);
    /* Port resume on */
    port0.d32 = USB_OTG_ReadHPRT0(pdev);
    port0.b.prtsusp = 0U;
    port0.b.prtres = 1U;
    USB_OTG_WRITE_REG32(pdev->regs.HPRT0, port0.d32);

    USB_OTG_BSP_mDelay(20UL);

    /* Port resume off */
    port0.b.prtres = 0U;
    USB_OTG_WRITE_REG32(pdev->regs.HPRT0, port0.d32);
}

//void USB_OTG_INTI_SRP(USB_OTG_CORE_HANDLE *pdev)
//{
//}


#endif /* USE_HOST_MODE */


/**
 * @}
 */


#endif /* DDL_USBFS_ENABLE */

/**
 * @}
 */

/**
* @}
*/


/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
